DataProcessors/ПечатьКвитанций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ПечатьКвитанций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапаковатьZIP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматPDF</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматODS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматXLS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматMXL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовСМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСотовогоТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Печать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ШаблоныТекстовПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ШаблоныТекстовПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПечатьКвитанций/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("РассылкаДоступа") тогда
		ШаблонПисьма = Справочники.ШаблоныТекстовПисем.ШаблонРассылкиДоступовНаСайтХВОЯ;
		АдресСайта = ПолучитьАдресСайтаХвояЖКХ(Объект.Организация);
		Элементы.РазослатьSMS.Видимость = Ложь;
		Элементы.ТаблицаБанковскихСчетов.Видимость = Ложь;
		Элементы.МесяцНачислений.Видимость = Ложь;
		Элементы.УпрощеннаяКвитанция.Видимость = Ложь;
		Элементы.ЛицевыеСчетаПечать.Видимость = Ложь;
		Элементы.Отправить.Видимость = Ложь;
		Элементы.ПрооверитьИОбновитьСатусыСМС1.Видимость = Ложь;
		Элементы.РассылкаДоступов.Видимость = Истина;
	КонецЕсли;
	
	Объект.МесяцНачислений = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.МесяцНачислений, "ДФ='MMMM yyyy'");
	
	Элементы.Заполнить.Доступность = Ложь;
	
	
	Попытка
		СодержаниеПисьма = ПолучитьСодержаниеЭлектронногоПисьма();
		
		
		КолСтрок = СодержаниеПисьма.Количество()-1;
		
		Для Индекс = 0 По КолСтрок Цикл
			
			Если  СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ЗапаковатьВZIP тогда
				Объект.ЗапаковатьZIP = СодержаниеПисьма[Индекс].Значение;
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.УпрощеннаяКвитанция Тогда
				УпрощеннаяКвитанция = СодержаниеПисьма[Индекс].Значение;
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ФорматHTML Тогда
				Объект.ФорматHTML = СодержаниеПисьма[Индекс].Значение;
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ФорматMXL Тогда
				Объект.ФорматMXL = СодержаниеПисьма[Индекс].Значение;
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ФорматODS Тогда
				Объект.ФорматODS = СодержаниеПисьма[Индекс].Значение;
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ФорматPDF Тогда
				Объект.ФорматPDF = СодержаниеПисьма[Индекс].Значение;	
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ФорматXLS Тогда
				Объект.ФорматXLS = СодержаниеПисьма[Индекс].Значение;
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ШаблонТекстаПисьма Тогда
				ШаблонПисьма = СодержаниеПисьма[Индекс].Значение;
				ТекстПисьма = ШаблонПисьма.ТекстПисьма;
				ТемаПисьма = ШаблонПисьма.ТемаПисьма;
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ШаблонСМС Тогда
				Объект.ШаблонСМС = СодержаниеПисьма[Индекс].Значение;	
			ИначеЕсли СодержаниеПисьма[Индекс].Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ПеревестиВЛатиницу Тогда
				ПеревестиВЛатинскиеСимволы = СодержаниеПисьма[Индекс].Значение;
			КонецЕсли;
		КонецЦикла;	
	Исключение	
	КонецПопытки;

	
	Если КоличествоВГруппеНаПечать = 0 Тогда
		
		КоличествоВГруппеНаПечать = 20;
		
	КонецЕсли;
	
//{{MRG[ <-> ]
//	СсылкаДопПечатнойФормы = ПечатьКвитанцииНаОплату.ПолучитьСсылкуДопПечатнойФормы();
//}}MRG[ <-> ]
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Для каждого Строка Из ТаблицаДляЗагрузки Цикл
		НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
		НоваяСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
		НоваяСтрока.АдресЭлектроннойПочты = Строка.ЛицевойСчет.ЭлПочта;
		НоваяСтрока.НомерСотовогоТелефона = Строка.ЛицевойСчет.МобТелефон;
	КонецЦикла;
	
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

//Функция возвращает истину, если месяц закрыт.
//
&НаСервере
Функция ПроверитьЗакрытиеМесяца()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗакрытиеМесяца.Проведен
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|ГДЕ
	|	ЗакрытиеМесяца.Организация = &Организация
	|	И ЗакрытиеМесяца.Здание = &Здание
	|	И МЕСЯЦ(ЗакрытиеМесяца.Дата) = &Месяц
	|	И ГОД(ЗакрытиеМесяца.Дата) = &Год";
	
	Запрос.УстановитьПараметр("Год", Год(Объект.МесяцНачислений));
	Запрос.УстановитьПараметр("Здание", Объект.Здание);
	Запрос.УстановитьПараметр("Месяц", Месяц(Объект.МесяцНачислений));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	МесяцЗакрыт = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Проведен Тогда
			МесяцЗакрыт = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МесяцЗакрыт;
	
КонецФункции

// Процедура - обработчик события ПриИзменении поля ввода "Здание".
//
&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		Элементы.Заполнить.Доступность = Истина;
		
	Иначе
		
		Элементы.Заполнить.Доступность = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "МесяцНачислений".
//
&НаКлиенте
Процедура МесяцНачисленийПриИзменении(Элемент)
	
	ЭтаФорма.Объект.МесяцНачислений 		= КонецМесяца(ЭтаФорма.Объект.МесяцНачислений);
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.МесяцНачислений, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "МесяцНачислений".
//
&НаКлиенте
Процедура МесяцНачисленийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.МесяцНачислений= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.МесяцНачислений));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.МесяцНачислений = КонецДня(ДатаКалендаряНачало);
	
	МесяцНачисленийПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "МесяцНачислений".
//
&НаКлиенте
Процедура МесяцНачисленийРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭтаФорма.Объект.МесяцНачислений = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.МесяцНачислений), 
	ДобавитьМесяц(ЭтаФорма.Объект.МесяцНачислений, Направление),
	ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
	
	МесяцНачисленийПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку Печать.
//
&НаКлиенте
Процедура Печать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить(НСтр("ru='Поле ""Организация"" не заполнено';uk='Полі ""Організація"" не заповнено'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		Сообщить(НСтр("ru='Поле ""Здание"" не заполнено';uk='Полі ""Будівля"" не заповнена'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.МесяцНачислений) Тогда
		Сообщить(НСтр("ru='Поле ""МесяцНачислений"" не заполнено';uk='Полі ""МесяцНачислений"" не заповнено'"));
		Возврат;
	Иначе
		МесяцЗакрыт = ПроверитьЗакрытиеМесяца();
		Если НЕ МесяцЗакрыт Тогда
			Сообщить(НСтр("ru='Месяц не закрыт!';uk='Місяць не закритий!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ЛицевыеСчета.Количество()>КоличествоВГруппеНаПечать Тогда
		КоличествоКПечати = КоличествоВГруппеНаПечать;
	Иначе
		КоличествоКпечати = КонСтрока - НачСтрока + 1;
	КонецЕсли;
	Ответ = Вопрос(НСтр("ru = ""Будет напечатано " + КоличествоКПечати + " квитанций из " + Объект.ЛицевыеСчета.Количество() + ". Продолжить?"";uk=""Буде надруковано " + КоличествоКПечати + " квітанцій з " + Объект.ЛицевыеСчета.Количество() + ". Продовжити?"""), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ГрупповаяПечать();
	
КонецПроцедуры

//Процедура пакетной печати квитанций.
//
&НаКлиенте
Процедура ГрупповаяПечать()
	
	МассивЛС = Новый Массив;
	
	Счетчик = 0;
	СчетчикСтатус = 0;
	Осталось = КонСтрока - НачСтрока + 1;
	
	Список = Новый СписокЗначений;
	Список.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета");
	
	Для каждого Строка из Объект.ЛицевыеСчета Цикл
		
		Если Строка.НомерСтроки <= КонСтрока И Строка.НомерСтроки >= НачСтрока Тогда
			
			Если Счетчик < КоличествоВГруппеНаПечать Тогда
				
				Список.Добавить(Строка.ЛицевойСчет);
				Счетчик = Счетчик + 1;
				Осталось = Осталось - 1;
				
				Если Осталось = 0 Тогда
					
					Счетчик = 0;
					МассивОбъектов = Новый Массив;
					Структура = Новый Структура;
					Структура.Вставить("Счет", Список);
					Структура.Вставить("Месяц", Объект.МесяцНачислений);
					Структура.Вставить("БанковскийСчет", Объект.БанковскиеСчета);
					МассивОбъектов.Добавить(Структура);
//{{MRG[ <-> ]
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//						КлючУникальности = Строка(Новый УникальныйИдентификатор);
//						ПараметрыОткрытия = Новый Структура("СсылкаДопПечатнойФормы,ИменаМакетов,МассивОбъектов,ПараметрыПечати");
//						ПараметрыОткрытия.СсылкаДопПечатнойФормы = СсылкаДопПечатнойФормы;
//						ПараметрыОткрытия.ИменаМакетов		 = ТипМакета;
//						ПараметрыОткрытия.МассивОбъектов	 = МассивОбъектов;
//						ПараметрыОткрытия.ПараметрыПечати	 = Неопределено;
//						// Откроем форму печати документов
//						ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, КлючУникальности);
//					Иначе
//						УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//					КонецЕсли;
//}}MRG[ <-> ]
					Список.Очистить();
					МассивОбъектов.Очистить();
					
				КонецЕсли;
				СчетчикСтатус = СчетчикСтатус+1;
				Состояние(Нстр("ru = 'Выполняется формирование квитанций'; uk = 'Виконується формування квитанцій'"),Окр(СчетчикСтатус/Мин(КоличествоВГруппеНаПечать,КонСтрока)*100));
			ИначеЕсли Счетчик = КоличествоВГруппеНаПечать Тогда
				
				Счетчик = 0;
				МассивОбъектов = Новый Массив;
				
				Структура = Новый Структура;
				Структура.Вставить("Счет", Список);
				Структура.Вставить("Месяц", Объект.МесяцНачислений);
				Структура.Вставить("БанковскийСчет", Объект.БанковскиеСчета);
				МассивОбъектов.Добавить(Структура);
				
//{{MRG[ <-> ]
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					КлючУникальности = Строка(Новый УникальныйИдентификатор);
//					ПараметрыОткрытия = Новый Структура("СсылкаДопПечатнойФормы,ИменаМакетов,МассивОбъектов,ПараметрыПечати");
//					ПараметрыОткрытия.СсылкаДопПечатнойФормы = СсылкаДопПечатнойФормы;
//					ПараметрыОткрытия.ИменаМакетов		 = ТипМакета;
//					ПараметрыОткрытия.МассивОбъектов	 = МассивОбъектов;
//					ПараметрыОткрытия.ПараметрыПечати	 = Неопределено;
//					// Откроем форму печати документов
//					ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, КлючУникальности);
//				Иначе
//					УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//				КонецЕсли;
//}}MRG[ <-> ]
				Список.Очистить();
				МассивОбъектов.Очистить();
				
				Список.Добавить(Строка.ЛицевойСчет);
				
				
				Если Осталось > КоличествоВГруппеНаПечать Тогда
					КоличествоКПечати = КоличествоВГруппеНаПечать;
				Иначе
					КоличествоКпечати = Осталось;
				КонецЕсли;
				
				Ответ = Вопрос(НСтр("ru = ""Будет напечатано " + КоличествоКПечати + " квитанций из оставшихся " + Осталось + ". Продолжить?"""), РежимДиалогаВопрос.ДаНет, 0);
				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат;
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				Осталось = Осталось - 1;
				
				Если Осталось = 0 Тогда
					
					Структура = Новый Структура;
					Структура.Вставить("Счет", Список);
					Структура.Вставить("Месяц", Объект.МесяцНачислений);
					Структура.Вставить("БанковскийСчет", Объект.БанковскиеСчета);
					МассивОбъектов.Добавить(Структура);
//{{MRG[ <-> ]
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//						КлючУникальности = Строка(Новый УникальныйИдентификатор);
//						ПараметрыОткрытия = Новый Структура("СсылкаДопПечатнойФормы,ИменаМакетов,МассивОбъектов,ПараметрыПечати");
//						ПараметрыОткрытия.СсылкаДопПечатнойФормы = СсылкаДопПечатнойФормы;
//						ПараметрыОткрытия.ИменаМакетов		 = ТипМакета;
//						ПараметрыОткрытия.МассивОбъектов	 = МассивОбъектов;
//						ПараметрыОткрытия.ПараметрыПечати	 = Неопределено;
//						// Откроем форму печати документов
//						ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, КлючУникальности);
//					Иначе
//						УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//					КонецЕсли;
//}}MRG[ <-> ]
					Список.Очистить();
					МассивОбъектов.Очистить();
					
				КонецЕсли;
				СчетчикСтатус = СчетчикСтатус+1;
				Состояние(Нстр("ru = 'Выполняется формирование квитанций'; uk = 'Виконується формування квитанцій'"),Окр(СчетчикСтатус/Мин(КоличествоВГруппеНаПечать,КонСтрока)*100));
			ИначеЕсли НЕ Счетчик < Осталось Тогда
				
				Счетчик = 0;
				Список.Добавить(Строка.ЛицевойСчет);
				МассивОбъектов = Новый Массив;
				
				Структура = Новый Структура;
				Структура.Вставить("Счет", Список);
				Структура.Вставить("Месяц", Объект.МесяцНачислений);
				Структура.Вставить("БанковскийСчет", Объект.БанковскиеСчета);
				МассивОбъектов.Добавить(Структура);
				
//{{MRG[ <-> ]
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//				Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					КлючУникальности = Строка(Новый УникальныйИдентификатор);
//					ПараметрыОткрытия = Новый Структура("СсылкаДопПечатнойФормы,ИменаМакетов,МассивОбъектов,ПараметрыПечати");
//					ПараметрыОткрытия.СсылкаДопПечатнойФормы = СсылкаДопПечатнойФормы;
//					ПараметрыОткрытия.ИменаМакетов		 = ТипМакета;
//					ПараметрыОткрытия.МассивОбъектов	 = МассивОбъектов;
//					ПараметрыОткрытия.ПараметрыПечати	 = Неопределено;
//					// Откроем форму печати документов
//					ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, КлючУникальности);
//				Иначе
//					УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКвитанций", ТипМакета, МассивОбъектов, ЭтаФорма, Неопределено);
//				КонецЕсли;
//}}MRG[ <-> ]
				Список.Очистить();
				МассивОбъектов.Очистить();
				СчетчикСтатус = СчетчикСтатус+1;
				Состояние(Нстр("ru = 'Выполняется формирование квитанций'; uk = 'Виконується формування квитанцій'"),Окр(СчетчикСтатус/Мин(КоличествоВГруппеНаПечать,КонСтрока)*100));
			КонецЕсли;
			
		КонецЕсли;
		МассивЛС.Добавить(Строка.ЛицевойСчет);
	КонецЦикла;
	//ПроведениеСервер.ОтразитьОперацииУведомления(МассивЛС,Объект.МесяцНачислений,"Квитанция");
	
КонецПроцедуры

// Процедура - обработчик нажатия на кнопку Заполнить.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.МесяцНачислений));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.МесяцНачислений));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
	НачСтрока = 1;
	КонСтрока = Объект.ЛицевыеСчета.Количество();
	
КонецПроцедуры

// Процедура - обработчик события ПередУдалением табличной части "ЛицевыеСчета".
//
&НаКлиенте
Процедура ЛицевыеСчетаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

// Процедура - обработчик события ПередНачаломДобавления табличной части "ЛицевыеСчета".
//
&НаКлиенте
Процедура ЛицевыеСчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если УпрощеннаяКвитанция = Истина Тогда
		ТипМакета = "МакетКвитанцииНаОплатуУпрощенная"
	Иначе
		ТипМакета = "МакетКвитанцииНаОплату"
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УпрощеннаяКвитанцияПриИзменении(Элемент)
	
	Если УпрощеннаяКвитанция = Истина Тогда
		ТипМакета = "МакетКвитанцииНаОплатуУпрощенная"
	Иначе
		ТипМакета = "МакетКвитанцииНаОплату"
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьСписокСчетов();
	
	АдресСайта = ПолучитьАдресСайтаХвояЖКХ(Объект.Организация);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокСчетов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
//{{MRG[ <-> ]
	|	БанковскиеСчета.Владелец = &Владелец";
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	|	БанковскиеСчета.Владелец = &Владелец
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	|	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ";
//}}MRG[ <-> ]
	
	Запрос.УстановитьПараметр("Владелец", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Объект.БанковскиеСчета.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.БанковскиеСчета.Добавить();
		НоваяСтрока.Печать = Истина;
		НоваяСтрока.БанковскийСчет = Выборка.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить(НСтр("ru='Поле ""Организация"" не заполнено';uk='Полі ""Організація"" не заповнено'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		Сообщить(НСтр("ru='Поле ""Здание"" не заполнено';uk='Полі ""Будівля"" не заповнена'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.МесяцНачислений) Тогда
		Сообщить(НСтр("ru='Поле ""МесяцНачислений"" не заполнено';uk='Полі ""МесяцНачислений"" не заповнено'"));
		Возврат;
	Иначе
		МесяцЗакрыт = ПроверитьЗакрытиеМесяца();
		Если НЕ МесяцЗакрыт Тогда
			Сообщить(НСтр("ru='Месяц не закрыт!';uk='Місяць не закритий!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ЛицевыеСчета.Количество()>КоличествоВГруппеНаПечать Тогда
		КоличествоКПечати = КоличествоВГруппеНаПечать;
	Иначе
		КоличествоКпечати = КонСтрока - НачСтрока + 1;
	КонецЕсли;
	Ответ = Вопрос(НСтр("ru = ""Будет отправлено " + КоличествоКПечати + " квитанций из " + Объект.ЛицевыеСчета.Количество() + ". Продолжить?"";uk=""Буде відправлено " + КоличествоКПечати + " квітанцій з " + Объект.ЛицевыеСчета.Количество() + ". Продовжити?"""), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ГрупповаяОтправка();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяОтправка()
	
	//МассивТабличныхДокументов = Новый Массив;
	МассивЛС = Новый Массив;
	Счетчик = 0;
	СчетчикСтатус = 0;
	Осталось = КонСтрока - НачСтрока + 1;
	
	Список = Новый СписокЗначений;
	Список.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета");
	
	Для каждого Строка из Объект.ЛицевыеСчета Цикл
		ЛС =Строка.ЛицевойСчет;
		ЭлПочта = ПолучитьСписокЛС(ЛС);
		Месяц = Объект.МесяцНачислений;
		Банки = Объект.БанковскиеСчета;
		
		Если Строка.НомерСтроки <= КонСтрока И Строка.НомерСтроки >= НачСтрока Тогда
			
			Если Счетчик < КоличествоВГруппеНаПечать Тогда
				
				Счетчик = Счетчик + 1;
				Осталось = Осталось - 1;
				
				Если ТипМакета = "МакетКвитанцииНаОплату" Тогда
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
					//ТабДок =  ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
					ТабДок =  ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплатуМарина(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплату(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок =  ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
				Иначе
//{{MRG[ <-> ]
					ТабДок = ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплатуУпрощенная(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок = ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
				КонецЕсли;
				ОтправитьПоПочте(ЛС,ТабДок,ЭлПочта);
				СчетчикСтатус = СчетчикСтатус+1;
				Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				
			ИначеЕсли Счетчик = КоличествоВГруппеНаПечать Тогда
				
				Счетчик = 0;
				
				Если ТипМакета = "МакетКвитанцииНаОплату" Тогда
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
					ТабДок =  ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплату(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок =  ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
				Иначе
//{{MRG[ <-> ]
					ТабДок = ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплатуУпрощенная(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок = ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
				КонецЕсли;
				
				ОтправитьПоПочте(ЛС,ТабДок,ЭлПочта);
				СчетчикСтатус = СчетчикСтатус+1;
				Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				
				Если Осталось > КоличествоВГруппеНаПечать Тогда
					КоличествоКПечати = КоличествоВГруппеНаПечать;
				Иначе
					КоличествоКпечати = Осталось;
				КонецЕсли;
				
				Ответ = Вопрос(НСтр("ru = ""Будет напечатано " + КоличествоКПечати + " квитанций из оставшихся " + Осталось + ". Продолжить?"""), РежимДиалогаВопрос.ДаНет, 0);
				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат;
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				Осталось = Осталось - 1;
				
				Если ТипМакета = "МакетКвитанцииНаОплату" Тогда
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
					ТабДок =  ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплату(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок =  ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
				Иначе
//{{MRG[ <-> ]
					ТабДок = ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплатуУпрощенная(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок = ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЭлПочта) Тогда
					ОтправитьПоПочте(ЛС,ТабДок,ЭлПочта);
					СчетчикСтатус = СчетчикСтатус+1;
					Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				Иначе
					Сообщить(НСтр("ru = 'Не заполнен адрес электронной почты. Письмо не отправлено.'; uk = 'Не заповнена адреса електронної пошти. Лист не відправлений.'"));
				КонецЕсли;
			ИначеЕсли НЕ Счетчик < Осталось Тогда
				
				
				
				Если ТипМакета = "МакетКвитанцииНаОплату" Тогда
					
//{{MRG[ <-> ]
					ТабДок =  ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплату(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок =  ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплату(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
					
				Иначе
//{{MRG[ <-> ]
//					Если ЗначениеЗаполнено(СсылкаДопПечатнойФормы) Тогда
//}}MRG[ <-> ]
					ТабДок = ПечатьКвитанцииНаОплату2.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//{{MRG[ <-> ]
//						ТабДок = ПечатьКвитанцииНаОплату.ВнешняяПечатьКвитанцииНаОплатуУпрощенная(СсылкаДопПечатнойФормы, ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					Иначе
//						ТабДок = ПечатьКвитанцииНаОплату.ПечатьКвитанцииНаОплатуУпрощенная(ЛС,Новый ТабличныйДокумент,Месяц, БАнки);
//					КонецЕсли;
//}}MRG[ <-> ]
					ТабДок.АвтоМасштаб = Истина;
					
				КонецЕсли;	
				Если ЗначениеЗаполнено(ЭлПочта) Тогда
					ОтправитьПоПочте(ЛС,ТабДок,ЭлПочта);
					СчетчикСтатус = СчетчикСтатус+1;
					Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				Иначе
					Сообщить(НСтр("ru = 'Не заполнен адрес электронной почты. Письмо не отправлено.'; uk = 'Не заповнена адреса електронної пошти. Лист не відправлений.'"));
				КонецЕсли;
				
				//МассивТабличныхДокументов.Добавить(ТабДок);
				
			КонецЕсли;
		КонецЕсли;
		МассивЛС.Добавить(Строка.ЛицевойСчет);
	КонецЦикла;
	
	//ПроведениеСервер.ОтразитьОперацииУведомления(МассивЛС,Объект.МесяцНачислений,"ЭлектронноеПисьмо");
	
	Ответ = Вопрос(НСтр("ru = 'Отправка писем завершена.'; uk = 'Відправка листів завершена.'"), РежимДиалогаВопрос.ОК); 
	
КонецПроцедуры // ГрупповаяОтправка()


&НаКлиенте
Процедура ОтправитьПоПочте(ЛС, ТАбДок = Неопределено, ЭлПочта)
	
	НастройкиСохранения = ПолучитьНастройкиСохранения();
	
	Если ТипЗнч(НастройкиСохранения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	
	СписокВложений = Новый СписокЗначений;
	
	Если ТАбДок <> Неопределено Тогда
		ПоместитьТабличныеДокументыВоВременноеХранилище(СписокВложений, НастройкиСохранения, ТабДок, ЛС);
	КонецЕсли;	
	
	Если  НЕ ЗначениеЗаполнено(ШаблонПисьма) Тогда
		
		ТекстВопроса = НСтр("ru = 'Для текущего пользователя не установлен шаблон темы и текста письма.
		|Выбрать шаблон?'; uk = 'Для поточного користувача не встановлений шаблон теми і тексту листа.
		|Вибрати шаблон?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да тогда
			ОткрытьФормуМодально("Справочник.ШаблоныТекстовПисем.ФормаВыбора",,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;	
	
	
	
	ТемаПисьма = ПолучитьТекстПисьмаСервер(ЛС,"ТемаПисьма");
	ТекстПисьма = ПолучитьТекстПисьмаСервер(ЛС,"ТекстПисьма");
	
	ПараметрыПисьма = Новый Структура;
	
	ПараметрыПисьма.Вставить("УчетнаяЗапись", Неопределено);
	ПараметрыПисьма.Вставить("Кому", ЭлПочта);
	ПараметрыПисьма.Вставить("Тема", ТемаПисьма);
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыПисьма.Вставить("Вложения", СписокВложений);
	ПараметрыПисьма.Вставить("УдалятьФайлыПослеОтправки", Истина);
	
	Форма = ПолучитьФорму("ОбщаяФорма.ОтправкаСообщения", ПараметрыПисьма);
	Форма.ОтправитьПисьмоВыполнить(Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстПисьмаСервер(ЛицевойСчет,Текст)
	Если Текст = "ТемаПисьма" Тогда
		Параметр = ШаблонПисьма.ТемаПисьма;
	Иначе
		Параметр = ШаблонПисьма.ТекстПисьма;
	КонецЕсли;	
	  МассивЛС = ПолучитьДанныеЛицевыхСчетов(ЛицевойСчет);
	  МассивТекстов = СтроковыеФункцииКлиентСервер.СформироватьТекстSMSСообщения(МассивЛС,Параметр,АдресСайта);
	  Возврат МассивТекстов[0];
КонецФункции

&НаКлиенте
Процедура ПоместитьТабличныеДокументыВоВременноеХранилище(СписокФайлов, НастройкиСохранения, ТабДок, ЛС)
	
	
	ЗаписьZipФайла = Неопределено;
	ИмяАрхива = Неопределено;
	Если НастройкиСохранения.ЗапаковатьZIP Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	СписокТипов = НастройкиСохранения.СписокТипов;
	
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	
	
	НомерПечатнойФормы = ЛС;
	Для Каждого ТипФайла Из СписокТипов Цикл
		
		ИмяФайла = "[ИмяМакета] ([НомерПечатнойФормы]).[Расширение]";
		
		ИмяФайла = СтрЗаменить(ИмяФайла, "[ИмяМакета]",			 ЛС);
		ИмяФайла = СтрЗаменить(ИмяФайла, "[НомерПечатнойФормы]", НомерПечатнойФормы);
		ИмяФайла = СтрЗаменить(ИмяФайла, "[Расширение]",		 ТипФайла.Представление);
		
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
		
		ИмяВременногоФайла = ИмяВременнойПапки + "\" + ИмяФайла;
		ТабДок.Записать(ИмяВременногоФайла, ТипФайла.Значение);
		
		Если ТипФайла.Значение = ТипФайлаТабличногоДокумента.HTML Тогда
			ВставитьКартинкиВHTML(ИмяВременногоФайла);
		КонецЕсли;			
		
		Если ЗаписьZipФайла <> Неопределено Тогда 
			ЗаписьZipФайла.Добавить(ИмяВременногоФайла);
		Иначе
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
			СписокФайлов.Добавить(ПутьВоВременномХранилище, ИмяФайла);
			УдалитьФайлы(ИмяВременногоФайла);
		КонецЕсли;
	КонецЦикла;
	
	
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Записать();
		ФайлАрхива = Новый Файл(ИмяАрхива);
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
		СписокФайлов.Добавить(ПутьВоВременномХранилище, ФайлАрхива.Имя);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременнойПапки);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок = ФайлHTML.ИмяБезРасширения + "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// ожидается, что в папке будут только картинки
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ИмяПапкиКартинок + "\" + ФайлКартинки.Имя, КартинкаТекстом);
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокЛС(ЛС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛицевыеСчета.ЭлПочта
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ЛС);
	Результат = Запрос.Выполнить().выбрать();
	Результат.Следующий();
	Возврат Результат.ЭлПочта;
	
	
КонецФункции // ПолучитьСписокЛС()


&НаКлиенте
Функция  ПолучитьНастройкиСохранения()
	
	СписокТипов = Новый СписокЗначений;
	Если Объект.ФорматMXL Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.MXL, "mxl");
	КонецЕсли;
	
	Если Объект.ФорматHTML Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.HTML, "html");
	КонецЕсли;
	
	Если Объект.ФорматXLS Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.XLS, "xls");
	КонецЕсли;
	
	Если Объект.ФорматPDF Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.PDF, "pdf");
	КонецЕсли;
	
	Если Объект.ФорматODS Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.ODS, "ods");
	КонецЕсли;
	
	
	//Если СписокТипов.Количество() = 0 Тогда
	//	Предупреждение(НСтр("ru='Необходимо указать как минимум один из предложенных форматов.';uk=' Необхідно вказати як мінімум один із запропонованих форматів.'"));
	//	Возврат;
	//КонецЕсли;	
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапаковатьZIP", ЗапаковатьВZIP);
	Результат.Вставить("СписокТипов", СписокТипов);
	
	Возврат Результат;
	
КонецФункции // ПолучитьНастройкиСохранения()()

&НаКлиенте
Процедура РазослатьSMS(Команда)
	
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Поле ""Организация"" не заполнено';uk='Полі ""Організація"" не заповнено'");
		Сообщение.Поле = "Объект.Организация";
		Сообщение.Сообщить();
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Здание) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Поле ""Здание"" не заполнено';uk='Полі ""Будівля"" не заповнена'");
		Сообщение.Поле = "Объект.Здание";
		Сообщение.Сообщить(); 
		
	ИначеЕсли Объект.ЛицевыеСчета.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не заполнена таблица лицевых счетов';uk='Не заповнена таблиця особових рахунків'");
		Сообщение.Поле = "Объект.ЛицевыеСчета";
		Сообщение.Сообщить(); 
	КонецЕсли; 
	
	
	РассылкаSMSНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура РассылкаSMSНаСервере ()
	
	ЛицевыеСчета = Новый Массив;
	Для Каждого Строка Из Объект.ЛицевыеСчета Цикл
		ЛицевыеСчета.Добавить(Строка.ЛицевойСчет);
	КонецЦикла;
	
	МассивЛС = ПолучитьДанныеЛицевыхСчетов(ЛицевыеСчета);	
	
	Результат = СтроковыеФункцииКлиентСервер.СформироватьТекстSMSСообщения(МассивЛС, Объект.ШаблонСМС.ТекстШаблона);	
	
	РезультатОтправки = ОтправкаSMS.ОтправитьSMSГрупповая(МассивЛС,Результат,,ПеревестиВЛатинскиеСимволы);
	СтатусыДоставки = ОтправкаSMSЧерезАльфаSMS.СтатусДоставкиКомплекс(РезультатОтправки.ОтправленныеСообщения,,);
	Если РезультатОтправки.ОписаниеОшибки = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Сообщения отправлены'; uk = 'Повідомлення відправлені'");
		Сообщение.Сообщить();
		
		ПроведениеСервер.ОтразитьОперацииУведомления(СтатусыДоставки,Объект.МесяцНачислений,"СообщениеСМС");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЛицевыхСчетов(ЛС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛицевыеСчета.ОбъектЛицевогоСчета КАК ОбъектЛС,
	|	ЛицевыеСчета.ОбъектЛицевогоСчета.Владелец КАК Здание,
	|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
	|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток КАК Долг,
	|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК Дата,
	|	ЛицевыеСчета.МобТелефон КАК СотовыйТелефон
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних(&Дата, ) КАК ЛицевыеСчетаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Дата, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	|			ПО ЛицевыеСчета.Ссылка = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ) КАК РасчетыПоЛицевымСчетамОстатки
	|			ПО ЛицевыеСчета.Ссылка = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	|		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет = ЛицевыеСчета.Ссылка
	|ГДЕ
	|	ЛицевыеСчета.Ссылка В(&ЛицевойСчет)
	|	И ЛицевыеСчетаСрезПоследних.Действует = ИСТИНА";
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛС);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Результат =  Запрос.Выполнить().Выгрузить();
	
	
	МассивЛС = Новый Массив;
	Для каждого Строка Из Результат Цикл
		
		МассивЛС.Добавить(Строка);
		
		
	КонецЦикла; 
	
	Возврат МассивЛС;

КонецФункции // ПолучитьДанныеЛицевыхСчетов()


&НаКлиенте
Процедура ПрооверитьИОбновитьСатусыСМС(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация",Объект.Организация);
	ПараметрыОткрытия.Вставить("Здание",Объект.Здание);
	ПараметрыОткрытия.Вставить("МесяцНачисления",Объект.МесяцНачислений);
	
	ОткрытьФорму("Обработка.ПечатьКвитанций.Форма.ФормаПроверкиСтатусовСМС",ПараметрыОткрытия);
КонецПроцедуры

&НаСервере
Функция ПолучитьСодержаниеЭлектронногоПисьма()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПользователей.Пользователь,
	|	НастройкиПользователей.Настройка,
	|	ЕСТЬNULL(НастройкиПользователей.Значение, """") КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь",Пользователи.АвторизованныйПользователь());
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить();
	КонецЕсли;	
	
КонецФункции 

&НаКлиенте
Процедура ШаблонПисьмаПриИзменении(Элемент)
	ШаблонПисьмаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ШаблонПисьмаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(ШаблонПисьма) Тогда
		ТекстПисьма = ШаблонПисьма.ТекстПисьма;
		ТемаПисьма = ШаблонПисьма.ТемаПисьма;
		
	Иначе
		ТекстПисьма = "";
		ТемаПисьма = "";
	КонецЕсли;
	
	
КонецПроцедуры // ШаблонПисьмаПриИзмененииНаСервере()


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ШаблонПисьма = ВыбранноеЗначение;
	ШаблонПисьмаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура РассылкаДоступовНаСервере()
	//МассивТабличныхДокументов = Новый Массив;
	МассивЛС = Новый Массив;
	Счетчик = 0;
	СчетчикСтатус = 0;
	Осталось = КонСтрока - НачСтрока + 1;
	
	Список = Новый СписокЗначений;
	Список.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЛицевыеСчета");
	
	Для каждого Строка из Объект.ЛицевыеСчета Цикл
		ЛС =Строка.ЛицевойСчет;
		ЭлПочта = ПолучитьСписокЛС(ЛС);
		Месяц = Объект.МесяцНачислений;
		Банки = Объект.БанковскиеСчета;
		
		Если Строка.НомерСтроки <= КонСтрока И Строка.НомерСтроки >= НачСтрока Тогда
			
			Если Счетчик < КоличествоВГруппеНаПечать Тогда
				
				Счетчик = Счетчик + 1;
				Осталось = Осталось - 1;
				
				ОтправитьПоПочте(ЛС,Неопределено,ЭлПочта);
				СчетчикСтатус = СчетчикСтатус+1;
				Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				
			ИначеЕсли Счетчик = КоличествоВГруппеНаПечать Тогда
				
				Счетчик = 0;
				ОтправитьПоПочте(ЛС,Неопределено,ЭлПочта);
				СчетчикСтатус = СчетчикСтатус+1;
				Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				
				Если Осталось > КоличествоВГруппеНаПечать Тогда
					КоличествоКПечати = КоличествоВГруппеНаПечать;
				Иначе
					КоличествоКпечати = Осталось;
				КонецЕсли;
				
				Ответ = Вопрос(НСтр("ru = ""Будет напечатано " + КоличествоКПечати + " квитанций из оставшихся " + Осталось + ". Продолжить?"""), РежимДиалогаВопрос.ДаНет, 0);
				Если Ответ <> КодВозвратаДиалога.Да Тогда
					Возврат;
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				Осталось = Осталось - 1;
				
				Если ЗначениеЗаполнено(ЭлПочта) Тогда
					ОтправитьПоПочте(ЛС,Неопределено,ЭлПочта);
					СчетчикСтатус = СчетчикСтатус+1;
					Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				Иначе
					Сообщить(НСтр("ru = 'Не заполнен адрес электронной почты. Письмо не отправлено.'; uk = 'Не заповнена адреса електронної пошти. Лист не відправлений.'"));
				КонецЕсли;
			ИначеЕсли НЕ Счетчик < Осталось Тогда
				
				
				
				Если ЗначениеЗаполнено(ЭлПочта) Тогда
					ОтправитьПоПочте(ЛС,Неопределено,ЭлПочта);
					СчетчикСтатус = СчетчикСтатус+1;
					Состояние(Нстр("ru = 'Выполняется отправка электронной почты'; uk = 'Виконується відправка електронної пошти'"),Окр(СчетчикСтатус/КоличествоВГруппеНаПечать*100));
				Иначе
					Сообщить(НСтр("ru = 'Не заполнен адрес электронной почты. Письмо не отправлено.'; uk = 'Не заповнена адреса електронної пошти. Лист не відправлений.'"));
				КонецЕсли;
				
				//МассивТабличныхДокументов.Добавить(ТабДок);
				
			КонецЕсли;
		КонецЕсли;
		МассивЛС.Добавить(Строка.ЛицевойСчет);
	КонецЦикла;
	
	//ПроведениеСервер.ОтразитьОперацииУведомления(МассивЛС,Объект.МесяцНачислений,"ЭлектронноеПисьмо");
	
	Ответ = Вопрос(НСтр("ru = 'Отправка писем завершена.'; uk = 'Відправка листів завершена.'"), РежимДиалогаВопрос.ОК); 

КонецПроцедуры


&НаКлиенте
Процедура РассылкаДоступов(Команда)
	
	Если СокрЛП(АдресСайта) = "" Тогда
		
		Сообщить(НСтр("ru = 'Не введен адрес Вашего сайта'; uk = 'Не введена адреса Вашого сайту'"));
				
	КонецЕсли;	
	
	Если Объект.ЛицевыеСчета.Количество() > КоличествоВГруппеНаПечать Тогда
		КоличествоКПечати = КоличествоВГруппеНаПечать;
	Иначе
		КоличествоКпечати = КонСтрока - НачСтрока + 1;
	КонецЕсли;
	Ответ = Вопрос(НСтр("ru = ""Будет отправлено " + КоличествоКПечати + " сообщений из " + Объект.ЛицевыеСчета.Количество() + ". Продолжить?"";uk=""Буде відправлено " + КоличествоКПечати + " повiдомлень з " + Объект.ЛицевыеСчета.Количество() + ". Продовжити?"""), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РассылкаДоступовНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьАдресСайтаХвояЖКХ(Организация)
	
	ТаблицаНастройки = Константы.НастройкаОбменДаннымиХвояСайтЖКХ.Получить().Получить();
	Если НЕ ТипЗнч(ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
		Возврат "";
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаНастройки.НайтиСтроки(Новый Структура("Организация", Организация));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат НайденныеСтроки[0].АдресСайта;	
	КонецЕсли;
	
КонецФункции
